readme.org
* Welcome to Splitboard
Keyboard firmware written for the  esp32. I wanted to have a
bluetooth  split  keyboard  for  a while  so  I  wrote  this
firmware. The software takes  heavy inspiration from the [[https://docs.qmk.fm/#/][QMK
firmware]], and was developed using Platformio.

* Features
- [X] Split communication over esp_now
- [X] Layer support
  + Up to 16 layers
- [X] LED support through [[https://github.com/FastLED][FastLED]]
- [X] OLED support through [[https://github.com/olikraus/u8g2][U8G2]]
- [X] Layer tap functionality
  + Tap for keycode, hold for layer switch
- [ ] Space cadet keys
  + Shift when tapped, shift was modifier.


* Know projects
- [[https://github.com/cvanelteren/Elanor][Elanor]]
