readme.md

# Table of Contents

1.  [Welcome to Splitboard](#orge151485)
2.  [Features](#orgcb3fcca)
3.  [Know projects](#org8324adf)


<a id="orge151485"></a>

# Welcome to Splitboard

Keyboard firmware written for the  esp32. I wanted to have a
bluetooth  split  keyboard  for  a while  so  I  wrote  this
firmware. The software takes  heavy inspiration from the [QMK
firmware](https://docs.qmk.fm/#/), and was developed using Platformio.


<a id="orgcb3fcca"></a>

# Features

-   [X] Split communication over esp<sub>now</sub>
-   [X] Layer support
    -   Up to 16 layers
-   [X] LED support through [FastLED](https://github.com/FastLED)
-   [X] OLED support through [U8G2](https://github.com/olikraus/u8g2)
-   [X] Layer tap functionality
    -   Tap for keycode, hold for layer switch
-   [ ] Space cadet keys
    -   Shift when tapped, shift was modifier.


<a id="org8324adf"></a>

# Know projects

-   [Elanor](https://github.com/cvanelteren/Elanor)

